/*
//================================================================================
//
// 文件名:    F28335_DefaultIsr.h
//
// 功能描述:   
//			  F28335默认中断服务程序定义.
//
// 编写者:    伍泽东
// 编写日期:  2011-3-28
//
//================================================================================
*/

#ifndef DSP28335_DEFAULT_ISR_H
#define DSP28335_DEFAULT_ISR_H

#ifdef __cplusplus
extern "C" {
#endif


///---------------------------------------------------------------------------
// 默认中断服务程序定义.
// 
// 下面的函数原型用于默认的PIE向量表
// 这个默认的中断向量表在 DSP28_PieVect.h 
//


interrupt void rsvd_ISR(void);           // 假中断


#ifdef __cplusplus
}
#endif /* extern "C" */

#endif    // F28335_DEFAULT_ISR_H 定义结束



//===========================================================================
// no more.
//===========================================================================


